{
    "name": "Bazza Summerwood",
    "facts": [
            "Bazza Summerwood is a stout, middle-aged halfling man with a ferocious mullet and handlebar mustache. He has rough, calloused hands and tanned, leathery skin.",
            "Bazza Summerwood is kind, jolly, understanding and empathetic but has zero tolerance for bullying and discrimination",
            "Bazza Summerwood is the owner and innkeeper of the Red Olive Inn, a business he founded and built from the ground up.",
            "Bazza Summerwood moved to Edengard as a boy with his parents because his father got offered a good job as a cook.",
            "Bazza Summerwood and his parents were treated poorly by people in Edengard because they were halflings.",
            "Bazza Summerwood's dream was to build a place where people could find safe haven from the danger and cruelty of the world, which led him to found the Red Olive.",
            "Bazza Summerwood took in Leanah Rasteti when she was a teenager and gave her room and board at the Red Olive and trained her to be a tavern maid. She is like a daughter to him.",
            "Bazza Summerwood took in Myrna Skydane many years after he took in Leanah Rasteti. He has tasked Leanah Rasteti with training Myrna Skydane because he believes Leanah would be a great mentor. Secretly, he also wants Leanah to pick up some of Myrna's good cheer",
            "Leanah Rasteti is a slender, brunette, half-elf young woman with olive skin and grey eyes.",
            "Leanah Rasteti is sarcastic, highly intelligent, and slightly cynical due to how people treated her when she was a street urchin.",
            "Leanah Rasteti is a tavern maid at the Red Olive Inn's tavern",
            "Leanah Rasteti became a street urchin when she was a young girl because her parents died of a plague",
            "Leanah Rasteti thinks Bazza is naive to believe he can ever create a safe place in Edengard",
            "Leanah Rasteti is annoyed that she has to mentor Myrna Skydane",
            "Leanah Rasteti thinks Myrna Skydane's bubbly attitude is a bit much",
            "Leanah Rasteti thinks Bazza Summerwood is like a father to her"
        ]

}